Диплом/src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗадач</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОплаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сдача</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗадачаКурьеру</types>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Documents/ЗадачаКурьеру/ЗадачаКурьеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачаКурьеру</name>
  <attributes>
    <name>ФИО_клиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СдачаДляКурьеров</name>
    <type>
      <types>EnumRef.Сдача</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Диплом/src/Documents/МаршрутныйЛист/Forms/ФормаДокумента/Module.bsl
перем АдресВХранилище экспорт;

&НаКлиенте
Процедура ДобавитьИзСпискаЗадач(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Документ.ЗадачаКурьеру.ФормаВыбора",ПараметрыФормы, Элементы.СписокЗадач);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ключ = Новый УникальныйИдентификатор();
	ЭтаФорма.КлючУникальности = Ключ;
	АдресВХранилище = ПоместитьВоВременноеХранилище(Ключ);
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СписокРеквизитов = Новый Структура;
	СписокРеквизитов.Вставить("Клиент",NULL);
	СписокРеквизитов.Вставить("Сдача",NULL);
	СписокРеквизитов.Вставить("Документ",NULL);
	СписокРеквизитов.Вставить("Сумма",NULL);
	СписокРеквизитов.Вставить("Адрес",NULL);
	СписокРеквизитов.Вставить("Телефон",NULL);
	СписокРеквизитов.Вставить("Время",NULL);
	СписокРеквизитов.Вставить("СпособОплаты",NULL);


	
	Для каждого ВыбранныйЭлемент из ВыбранноеЗначение Цикл
		Элементы.СписокЗадач.ДобавитьСтроку();
		ПолучитьРеквизитНаСервере(ВыбранныйЭлемент,СписокРеквизитов);
		
		Строка = Элементы.СписокЗадач.ТекущиеДанные;
		Строка.Клиент = СписокРеквизитов.Клиент;
		Строка.Сдача = СписокРеквизитов.Сдача;
		Строка.Сумма = СписокРеквизитов.Сумма;
	
		Строка.Телефон = СписокРеквизитов.Телефон;
		Строка.Документ = СписокРеквизитов.Документ;
		Строка.Адрес = СписокРеквизитов.Адрес;
		Строка.Время = СписокРеквизитов.Время;
		Строка.СпособОплаты = СписокРеквизитов.СпособОплаты;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьРеквизитНаСервере(СсылкаНаДок,СписокРеквизитов)
	СписокРеквизитов.Клиент = СсылкаНаДок.ФИО_клиента;   
	СписокРеквизитов.Сдача = Строка(СсылкаНаДок.СдачаДляКурьеров);
	СписокРеквизитов.Сумма = СсылкаНаДок.ИтоговаяСумма;
	СписокРеквизитов.Адрес = СсылкаНаДок.АдресДоставки;
	СписокРеквизитов.Телефон = СсылкаНаДок.Телефон;
	СписокРеквизитов.Документ = СсылкаНаДок.Ссылка;
	СписокРеквизитов.Время = СсылкаНаДок.ДатаИВремяДоставки;
	СписокРеквизитов.СпособОплаты = Строка(СсылкаНаДок.СпособОплаты);
	
КонецПроцедуры
